#include<stdio.h>

// 指针加减  内存中指针的初始化和使用理解
// int型指针数组的理解: 没有意义, 而char类型就可以是字符串元素地址的应用


int main() {
    // int *a[2] = {(int *) 100, (int *)200}, **p1 = a;
    int *i[2] = {0x100000, 0x100008}, **ip = i;  // i表示指针数组,数组中的元素是指向16进制表示的int类型值的指针,ip是指向指针的指针.
    // 初始化指针ip, 内存给的随机地址从61fdf0开始,占用16字节, 前8字节内容为0x100000, 后8字节地址从61fdf8开始内容为0x100008

    int res1 = *ip;  // 假定此次是 ip: 0x61fdf0
    // 初始化res1变量, res1中存的内容, 即一级指针*ip指向的是数组i[0]的首地址, 其对应的内容0x100000,转化为十进制为1048576
    int res2 = *ip + 1;
    // 初始化指针res2, 地址移动1个sizeof(int)单位, 其对应的的内容到0x100004, 转化为十进制为1048580.

    printf("%d\t", res1);
    printf("%d\t\n", res2);


    int res3 = ip;
    // 初始化res3, 数组名ip表示的是该数组的首地址, 即i[0]的内容0x100000的首地址,内存中查看为61fdf0, 转化为十进制6422000

    int res4 = ip + 1;
    // 初始化指针res4, 地址移动1个sizeof(指针)单位,到61fdf8, 转化为十进制6422008

    int res5 = *(ip + 1);
    // 初始化指针res5,存的内容是61fdf8地址指向的内容为0x100008, 转化为十进制1048584

    printf("%d\t", res3);
    printf("%d\t", res4);
    printf("%d\t", res5);

    return 0;
}
